Tekla.Structures.ModelInternal.RebarSet
Defines a rebar set.

Tekla.Structures.ModelInternal.RebarSet.MaxLegFaces
The max leg faces.

Tekla.Structures.ModelInternal.RebarSet.MaxGuidelines
The max guidelines.

Tekla.Structures.ModelInternal.RebarSet.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.RebarSet class.
Initializes a new rebar set instance with empty attributes.

Tekla.Structures.ModelInternal.RebarSet.Insert
Inserts the rebar set instance into the database.
Returns: true if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarSet.Modify
Modifies the RebarSet updating any add or remove operations.
Returns: true if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarSet.Delete
Deletes the rebar set instance from the database.
Returns: true if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarSet.Select
Selects the rebar set instance from the database.
Returns: true if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarSet.GetAdditions
Returns an enumerator of all rebar set additions.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.ModelInternal.RebarSet.GetStrips
Returns an enumerator of all rebar set strips.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.ModelInternal.RebarSet.CloneRebarSet
Clone the rebarset.
Returns: The Tekla.Structures.ModelInternal.RebarSet.

Tekla.Structures.ModelInternal.RebarSet.CreateInstance
The create instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.RebarSet.ModifyInstance
The modify instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.RebarSet.SelectInstance
The select instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.RebarSet.Clear
Remove all the child objects.

Tekla.Structures.ModelInternal.RebarSet.ToStruct(Tekla.Structures.ModelInternal.dotRebarSet_t@)
The to struct.
p:
The p.

Tekla.Structures.ModelInternal.RebarSet.FromStruct(Tekla.Structures.ModelInternal.dotRebarSet_t@)
The from struct.
p:
The p.

Tekla.Structures.ModelInternal.RebarSet.RebarProperties
Gets the rebar properties for the set. May be overridden with guideline overrrides
only on the primary guideline.

Tekla.Structures.ModelInternal.RebarSet.LegFaces
Gets the rebar set's internal legfaces.

Tekla.Structures.ModelInternal.RebarSet.Guidelines
Gets the guidelines.